# Occupation

### Introduction:


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
dset = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user" , sep='|')

### Step 3. Assign it to a variable called users.

In [3]:
users = dset

In [4]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [5]:
users.groupby("occupation")['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [6]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [7]:
df_ratio = users.groupby(['occupation','gender']).gender.size().unstack(level=1)
df_ratio

gender            F      M
occupation
administrator  36.0   43.0
artist         13.0   15.0
doctor          NaN    7.0
educator       26.0   69.0
engineer        2.0   65.0
entertainment   2.0   16.0
executive       3.0   29.0
healthcare     11.0    5.0
homemaker       6.0    1.0
lawyer          2.0   10.0
librarian      29.0   22.0
marketing      10.0   16.0
none            4.0    5.0
other          36.0   69.0
programmer      6.0   60.0
retired         1.0   13.0
salesman        3.0    9.0
scientist       3.0   28.0
student        60.0  136.0
technician      1.0   26.0
writer         19.0   26.0

In [8]:
df_ratio["male_ratio"] = (df_ratio.M / df_ratio.sum(1))*100

In [9]:
df_ratio.sort_values(["male_ratio"], ascending = False)

gender            F      M  male_ratio
occupation
doctor          NaN    7.0  100.000000
engineer        2.0   65.0   97.014925
technician      1.0   26.0   96.296296
retired         1.0   13.0   92.857143
programmer      6.0   60.0   90.909091
executive       3.0   29.0   90.625000
scientist       3.0   28.0   90.322581
entertainment   2.0   16.0   88.888889
lawyer          2.0   10.0   83.333333
salesman        3.0    9.0   75.000000
educator       26.0   69.0   72.631579
student        60.0  136.0   69.387755
other          36.0   69.0   65.714286
marketing      10.0   16.0   61.538462
writer         19.0   26.0   57.777778
none            4.0    5.0   55.555556
administrator  36.0   43.0   54.430380
artist         13.0   15.0   53.571429
librarian      29.0   22.0   43.137255
healthcare     11.0    5.0   31.250000
homemaker       6.0    1.0   14.285714

In [10]:
df_ratio.male_ratio.astype(str) +'%'

occupation
administrator     54.43037974683544%
artist            53.57142857142857%
doctor                        100.0%
educator          72.63157894736842%
engineer          97.01492537313433%
entertainment     88.88888888888889%
executive                    90.625%
healthcare                    31.25%
homemaker        14.285714285714285%
lawyer            83.33333333333334%
librarian         43.13725490196079%
marketing         61.53846153846154%
none              55.55555555555556%
other             65.71428571428571%
programmer         90.9090909090909%
retired           92.85714285714286%
salesman                       75.0%
scientist         90.32258064516128%
student           69.38775510204081%
technician        96.29629629629629%
writer            57.77777777777777%
Name: male_ratio, dtype: object

### Step 6. For each occupation, calculate the minimum and maximum ages

In [11]:
users.groupby("occupation")['age'].describe()[["min", "max"]]

                min   max
occupation
administrator  21.0  70.0
artist         19.0  48.0
doctor         28.0  64.0
educator       23.0  63.0
engineer       22.0  70.0
entertainment  15.0  50.0
executive      22.0  69.0
healthcare     22.0  62.0
homemaker      20.0  50.0
lawyer         21.0  53.0
librarian      23.0  69.0
marketing      24.0  55.0
none           11.0  55.0
other          13.0  64.0
programmer     20.0  63.0
retired        51.0  73.0
salesman       18.0  66.0
scientist      23.0  55.0
student         7.0  42.0
technician     21.0  55.0
writer         18.0  60.0

### Step 7. For each combination of occupation and gender, calculate the mean age

In [12]:
users.groupby(['occupation','gender']).mean().loc[:,'age':'age'].unstack(level=1)

                     age
gender                 F          M
occupation
administrator  40.638889  37.162791
artist         30.307692  32.333333
doctor               NaN  43.571429
educator       39.115385  43.101449
engineer       29.500000  36.600000
entertainment  31.000000  29.000000
executive      44.000000  38.172414
healthcare     39.818182  45.400000
homemaker      34.166667  23.000000
lawyer         39.500000  36.200000
librarian      40.000000  40.000000
marketing      37.200000  37.875000
none           36.500000  18.600000
other          35.472222  34.028986
programmer     32.166667  33.216667
retired        70.000000  62.538462
salesman       27.000000  38.555556
scientist      28.333333  36.321429
student        20.750000  22.669118
technician     38.000000  32.961538
writer         37.631579  35.346154

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [34]:
#users.groupby(['occupation'),'gender']).mean()['age']
# Porcentaje total por genero
(users['gender']).value_counts()/users['gender'].count()*100

M    71.049841
F    28.950159
Name: gender, dtype: float64

In [22]:
final_df=users.groupby(['occupation','gender']).agg({'user_id': 'count'})
final_df.head()

                      user_id
occupation    gender
administrator F            36
              M            43
artist        F            13
              M            15
doctor        M             7

In [34]:
final_df.groupby(level=0).apply(lambda x:100 * x / float(x.sum())).unstack(level=1).astype(str) + "%"

                           user_id
gender                           F                    M
occupation
administrator   45.56962025316456%   54.43037974683544%
artist          46.42857142857143%   53.57142857142857%
doctor                        nan%               100.0%
educator        27.36842105263158%   72.63157894736842%
engineer        2.985074626865672%   97.01492537313433%
entertainment   11.11111111111111%   88.88888888888889%
executive                   9.375%              90.625%
healthcare                  68.75%               31.25%
homemaker       85.71428571428571%  14.285714285714286%
lawyer         16.666666666666668%   83.33333333333333%
librarian       56.86274509803921%   43.13725490196079%
marketing       38.46153846153846%   61.53846153846154%
none            44.44444444444444%   55.55555555555556%
other          34.285714285714285%   65.71428571428571%
programmer      9.090909090909092%    90.9090909090909%
retired         7.142857142857143%   92.85714285714286%
salesman                     25.0%                75.0%
scientist        9.67741935483871%    90.3225806451613%
student        30.612244897959183%   69.38775510204081%
technician     3.7037037037037037%   96.29629629629629%
writer          42.22222222222222%   57.77777777777778%

In [13]:
step_7 = pd.pivot_table(data=users, values="age", index="occupation", columns="gender", aggfunc="count")
step_7=step_7.fillna(0)         #Reemplaza los valores nulos por ceros
step_7["total"]= step_7["F"]+step_7["M"]
step_7

gender            F      M  total
occupation
administrator  36.0   43.0   79.0
artist         13.0   15.0   28.0
doctor          0.0    7.0    7.0
educator       26.0   69.0   95.0
engineer        2.0   65.0   67.0
entertainment   2.0   16.0   18.0
executive       3.0   29.0   32.0
healthcare     11.0    5.0   16.0
homemaker       6.0    1.0    7.0
lawyer          2.0   10.0   12.0
librarian      29.0   22.0   51.0
marketing      10.0   16.0   26.0
none            4.0    5.0    9.0
other          36.0   69.0  105.0
programmer      6.0   60.0   66.0
retired         1.0   13.0   14.0
salesman        3.0    9.0   12.0
scientist       3.0   28.0   31.0
student        60.0  136.0  196.0
technician      1.0   26.0   27.0
writer         19.0   26.0   45.0

In [16]:
#Formatea las columnas con el signo porcentual al final
step_7["F"] = round(((step_7['F']/step_7['total'])*100),2).astype(str)+"%"
step_7["M"] = round(((step_7['M']/step_7['total'])*100),2).astype(str)+"%"
step_7

gender              F       M  total
occupation
administrator  45.57%  54.43%   79.0
artist         46.43%  53.57%   28.0
doctor           0.0%  100.0%    7.0
educator       27.37%  72.63%   95.0
engineer        2.99%  97.01%   67.0
entertainment  11.11%  88.89%   18.0
executive       9.38%  90.62%   32.0
healthcare     68.75%  31.25%   16.0
homemaker      85.71%  14.29%    7.0
lawyer         16.67%  83.33%   12.0
librarian      56.86%  43.14%   51.0
marketing      38.46%  61.54%   26.0
none           44.44%  55.56%    9.0
other          34.29%  65.71%  105.0
programmer      9.09%  90.91%   66.0
retired         7.14%  92.86%   14.0
salesman        25.0%   75.0%   12.0
scientist       9.68%  90.32%   31.0
student        30.61%  69.39%  196.0
technician       3.7%   96.3%   27.0
writer         42.22%  57.78%   45.0

In [17]:
#Elimina la columna total que se calculó para sacar el porcentaje
step_7.drop("total", axis = 1, inplace=True)
step_7

gender              F       M
occupation
administrator  45.57%  54.43%
artist         46.43%  53.57%
doctor           0.0%  100.0%
educator       27.37%  72.63%
engineer        2.99%  97.01%
entertainment  11.11%  88.89%
executive       9.38%  90.62%
healthcare     68.75%  31.25%
homemaker      85.71%  14.29%
lawyer         16.67%  83.33%
librarian      56.86%  43.14%
marketing      38.46%  61.54%
none           44.44%  55.56%
other          34.29%  65.71%
programmer      9.09%  90.91%
retired         7.14%  92.86%
salesman        25.0%   75.0%
scientist       9.68%  90.32%
student        30.61%  69.39%
technician       3.7%   96.3%
writer         42.22%  57.78%

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64